restlecture/assoc/app/controllers/cards_controller.rb

  def index
    @cards = Card.all
---
SELECT * FROM "cards"

  def show
    @card = Card.find(params[:id])
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)

  def store
    begin
      @card = Card.find(params[:id])
    rescue
      @card = Card.new
    end
    respond_to do |format|
      if @card.update_attributes(params[:card])
---
SELECT * FROM "cards" WHERE ("cards"."id" = 1)
UPDATE "cards" SET "updated_at" = '2010-06-16 00:17:26', "name" = 'hello' WHERE "id" = 1