testlecture/assoc2/app/controllers/phones_controller.rb

  def show
    @phone = Phone.find(params[:id])
---
SELECT * FROM "phones" WHERE ("phones"."id" = 1)