demome/app/controllers/tracks_controller.rb

  def show
    @track = Track.find(params[:id])
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 1)

  def edit
    @track = Track.find(params[:id])
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 2)

  def update
    @track = Track.find(params[:id])
    if @track.update_attributes(params[:track])
---
SELECT * FROM "tracks" WHERE ("tracks"."id" = 2)
UPDATE "tracks" SET "updated_at" = '2010-06-10 01:01:02', "title" = 'Wayward Child!' WHERE "id" = 2